conf/src/Documents/ЭП_ПланированиеТрудозатрат/ЭП_ПланированиеТрудозатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭП_ПланированиеТрудозатрат</name>
  <comment> Спиридонов А.И. 09.12.2024</comment>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.ЭП_СогласованныеЧасыПереработок</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_УчетОтгулов</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_ЧасыПереработокНаСогласование</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ЭП_СтатусыДокументаУтверждениеПереработок</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРасчетногоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРасчетногоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеПланаОтветственными</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеФактаОтветственными</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеОтветственными</name>
    <type>
      <types>EnumRef.ЭП_СогласованиеПланаФакта</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещениеСообщений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОтсветсвенных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ЭП_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.РазделыПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ТехническийПроект</name>
      <type>
        <types>CatalogRef.ТехническиеПроекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.ЗадачиПроцесса</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыПоТабелю</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Департамент</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Отгул</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыПереработок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПротоколВзаимодействия</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстПоручения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительУтвержденияПереработок</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.ЭП_СтатусыДокументаУтверждениеПереработок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

conf/src/Enums/ЭП_СтатусыДокументаУтверждениеПереработок/ЭП_СтатусыДокументаУтверждениеПереработок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭП_СтатусыДокументаУтверждениеПереработок</name>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>СогласованОтветственными</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>НовыйДокумент</name>
  </enumValues>
</mdclass:Enum>

conf/src/Documents/ЭП_ПланированиеТрудозатрат/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Пользователи.РолиДоступны("ЭП_СогласованиеТрудозатратКПремированию") Тогда
		
		Элементы.Согласовать.Видимость = Ложь;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиЭлементовШапкиФормы

&НаКлиенте
Процедура Согласовать(Команда)
	СогласоватьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбратчикиДинамическогоСпсика 

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.Статус) 
			И ТекущаяСтрока.Статус = ПредопределенноеЗначение("Перечисление.ЭП_СтатусыДокументаУтверждениеПереработок.НаСогласовании") Тогда
			Элементы.Согласовать.Видимость = Истина;
		Иначе
			Элементы.Согласовать.Видимость = Ложь;	
		КонецЕсли;
	Иначе
		Элементы.Согласовать.Видимость = Ложь;	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура СогласоватьНаСервере()
	
	Документы.ЭП_ПланированиеТрудозатрат.СогласоватьПереработки(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		Если ИмяСобытия = "СтатусНаСогласовании" Тогда
			
			Если Параметр.Статус = ПредопределенноеЗначение("Перечисление.ЭП_СтатусыДокументаУтверждениеПереработок.НаСогласовании")
				И ТекущаяСтрока.Ссылка = Параметр.Объект Тогда
				
				УстановитьОформление(ТекущаяСтрока, Истина);
				
			ИначеЕсли Параметр.Статус = ПредопределенноеЗначение("Перечисление.ЭП_СтатусыДокументаУтверждениеПереработок.НовыйДокумент")
				И ТекущаяСтрока.Ссылка = Параметр.Объект Тогда
				
				УстановитьОформление(ТекущаяСтрока, Ложь);
				
			ИначеЕсли Параметр.Статус = ПредопределенноеЗначение("Перечисление.ЭП_СтатусыДокументаУтверждениеПереработок.Отменен") 
				И ТекущаяСтрока.Ссылка = Параметр.Объект Тогда
				
				УстановитьОформление(ТекущаяСтрока, Ложь);
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформление(ТекущаяСтрока, ПараметрОтображения)
	
	Если ТекущаяСтрока <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.Статус) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Согласовать" ,"Видимость" ,ПараметрОтображения); 
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Согласовать" ,"Видимость" ,Ложь);	
		КонецЕсли; 	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
